# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.


l = ["wake up", 123, True, 456.789]
for i in l:
    print(f"{i} is type of {type(i).__name__}")
