# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

dct = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень",
       10: "Осень", 11: "Осень", 12: "Зима"}
m = ("Зима,Весна,Лето,Осень").split(",")
mnth = int(input("Номер месяца: "))
if mnth >= 1 and mnth <= 12:
    print(m[0] if mnth == 12 else m[(mnth) // 3])
    print(dct[mnth])
